; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v3)
             (pred_2 ?v5 ?v4)
             (pred_5 ?v13 ?v4)
             (pred_10 ?v10 ?v13 )
	     (pred_11 ?v13)
             (pred_4 ?v12)
             (pred_12 ?v5)
             (pred_3 ?v4)
             (pred_9 ?v13)
             (pred_7 ?v5)
             (pred_8 ?v13)
             (pred_1 ))



(:action op_2
:parameters (?v1 ?v6 ?v9 ?v11)
:precondition (and (pred_4 ?v1) (pred_4 ?v6) (pred_12 ?v9) (pred_3 ?v11)
          (pred_6 ?v1 ?v6) (pred_2 ?v9 ?v11)
                   (pred_5 ?v6 ?v11) (pred_11 ?v1) 
                   (pred_9 ?v6) (pred_7 ?v9))
:effect (and  (pred_8 ?v6) (not (pred_9 ?v6))))


(:action op_1
:parameters (?v1 ?v8)
:precondition (and (pred_4 ?v1) (pred_4 ?v8)
               (pred_11 ?v1) (pred_6 ?v1 ?v8) (pred_8 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v1))))

(:action op_4
:parameters (?v1 ?v9)
:precondition (and (pred_4 ?v1) (pred_12 ?v9) 
                  (pred_11 ?v1) (pred_10 ?v9 ?v1) (pred_1 ))
:effect (and (pred_7 ?v9)
   (not (pred_10 ?v9 ?v1)) (not (pred_1 ))))


(:action op_3
:parameters (?v1 ?v7 ?v2)
:precondition (and (pred_4 ?v1) (pred_12 ?v7) (pred_12 ?v2)
                  (pred_11 ?v1) (pred_7 ?v2) (pred_10 ?v7 ?v1))
:effect (and (pred_7 ?v7) (pred_10 ?v2 ?v1)
        (not (pred_7 ?v2)) (not (pred_10 ?v7 ?v1))))

(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_4 ?v1) (pred_12 ?v9) 
                  (pred_11 ?v1) (pred_7 ?v9))
:effect (and (pred_1 ) (pred_10 ?v9 ?v1) (not (pred_7 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_20 obj_08 obj_19 obj_16 obj_04 obj_05 obj_15 obj_02 obj_03 obj_09 obj_18 obj_06 obj_07 obj_01 obj_17
    obj_11 obj_13
    obj_10 obj_14
    )

    (:init
       (pred_1)

       (pred_4 obj_12)
       (pred_4 obj_20)
       (pred_4 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_09)
       (pred_4 obj_18)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_01)
       (pred_4 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_12 obj_10)
       (pred_12 obj_14)

       (pred_6 obj_12 obj_16)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_20 obj_04)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_20)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_20)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_05 obj_09)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_05)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_01)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_5  obj_03 obj_11)
       (pred_5  obj_08 obj_13)
       (pred_8 obj_12)
       (pred_8 obj_20)
       (pred_8 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_05)
       (pred_8 obj_15)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_17)

       (pred_2  obj_10 obj_11)
       (pred_2  obj_14 obj_13)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_14 obj_12)
       (pred_11 obj_12)
    )

    (:goal (and
       (pred_10 obj_10 obj_12)
       (pred_10 obj_14 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_16)))
)
)

; plan
1. (op_1 obj_12 obj_20)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_04)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_04)
   goals met: 0 of 2
3. (op_1 obj_04 obj_05)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_05)
   goals met: 0 of 2
4. (op_4 obj_05 obj_10)
   deleted: (pred_10 obj_10 obj_05) (pred_1)
   added: (pred_7 obj_10)
   goals met: 0 of 2
5. (op_1 obj_05 obj_04)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_04)
   goals met: 0 of 2
6. (op_1 obj_04 obj_20)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_20)
   goals met: 0 of 2
7. (op_1 obj_20 obj_12)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_12)
   goals met: 0 of 2
8. (op_3 obj_12 obj_14 obj_10)
   deleted: (pred_7 obj_10) (pred_10 obj_14 obj_12)
   added: (pred_7 obj_14) (pred_10 obj_10 obj_12)
   goals met: 1 of 2
9. (op_1 obj_12 obj_20)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_20)
   goals met: 1 of 2
10. (op_1 obj_20 obj_04)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_04)
   goals met: 1 of 2
11. (op_1 obj_04 obj_05)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_05)
   goals met: 1 of 2
12. (op_1 obj_05 obj_09)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_09)
   goals met: 1 of 2
13. (op_1 obj_09 obj_01)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_01)
   goals met: 1 of 2
14. (op_1 obj_01 obj_07)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_07)
   goals met: 1 of 2
15. (op_1 obj_07 obj_06)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_06)
   goals met: 1 of 2
16. (op_5 obj_06 obj_14)
   deleted: (pred_7 obj_14)
   added: (pred_1) (pred_10 obj_14 obj_06)
   goals met: 2 of 2
